Tekla Open API Reference for Tekla Structures 2025
FontAttributes Class
 The FontAttributes class contains the basic attributes for fonts.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.GenericAttributesBase
 Tekla.Structures.Drawing.FontAttributes
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class FontAttributes : GenericAttributesBase,
	ICloneable
<SerializableAttribute>
Public NotInheritable Class FontAttributes
	Inherits GenericAttributesBase
	Implements ICloneable
The FontAttributes type exposes the following members.
Constructors
Name | Description
FontAttributes()
 Creates a new font attributes instance. The default color is black, the height is 2.5, the font name is Arial and the values of italic and bold are false.
FontAttributes(DrawingColors, Double, String, Boolean, Boolean)
 Creates a new font attributes instance with the given parameters.
FontAttributes(TeklaDrawingColor, Double, String, Boolean, Boolean)
 Creates a new font attributes instance with the given parameters.
Top
Properties
Name | Description
Bold
 Whether the font is bold.
Color
 The color of the font.
Height
 The height of the font (in millimeters).
Italic
 Whether the font is italic.
Name
 The name of the font.
TrueColor
 The true color (rgb enabled) of the font.
Top
Methods
Name | Description
Clone
 Creates a new object that is a copy of the current instance.
IsEqual
 Compares the current object with an object of the same type.
 (Overrides GenericAttributesBase.IsEqual(Object).)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace